RIOT-OS/RIOT/cpu/esp32/include/periph_cpu.h
/*
 * In former ESP-IDF versions, SPI interfaces were identified by the alias
 * names `FSPI`, `HSPI` and `VSPI`, which are sometimes also used in data
 * sheets. These alias names have been declared obsolete in ESP-IDF. For
 * source code compatibility reasons these alias names are defined here.
 */
#define HSPI    SPI2_HOST   /**< Alias name for SPI2_HOST as used in former ESP-IDF versions */
#define FSPI    SPI2_HOST   /**< Alias name for SPI2_HOST as used in former ESP-IDF versions */
#define VSPI    SPI3_HOST   /**< Alias name for SPI3_HOST as used in former ESP-IDF versions */

/**
 * @brief   SPI configuration structure type
 */
typedef struct {
    spi_ctrl_t ctrl;        /**< SPI controller used for the interface */
    gpio_t sck;             /**< GPIO used as SCK pin */
    gpio_t mosi;            /**< GPIO used as MOSI pin */
    gpio_t miso;            /**< GPIO used as MISO pin */
    gpio_t cs;              /**< GPIO used as CS0 pin */
} spi_conf_t;

/**
 * @brief   Maximum number of SPI interfaces that can be used by board definitions
 */
#define SPI_NUMOF_MAX   (SOC_SPI_PERIPH_NUM - 1)

#define PERIPH_SPI_NEEDS_TRANSFER_BYTE  /**< requires function spi_transfer_byte */
#define PERIPH_SPI_NEEDS_TRANSFER_REG   /**< requires function spi_transfer_reg */
#define PERIPH_SPI_NEEDS_TRANSFER_REGS  /**< requires function spi_transfer_regs */
/** @} */

/**
 * @name   Timer configuration depending on which implementation is used
 *
 * There are two different implementations for hardware timers.
 *
 * - **Timer Module implementation** Depending on the ESP32x SoC variant
 *   (family) it provides up to 4 high speed timers, where 1 timer is used for
 *   system time. The remaining timer devices with **1 channel** each can be
 *   used as RIOT timer devices with a clock rate of 1 MHz.
 * - **Counter implementation** Dependent on the ESP32x SoC variant (family),
 *   the MCU has up to 3 CCOMPARE (cycle compare) registers. Two of them can be
 *   used to implement up to **2 timer devices** with **1 channel** each and a
 *   clock rate of 1 MHz. This is a feature of Xtensa-based ESP32x SoC variants.
 *
 * By default, the timer module is used. To use the counter implementation, add
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * USEMODULE += esp_hw_counter
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * to application's makefile.
 *
 * Timers are MCU built-in features and not board-specific. There is nothing to
 * be configured.
 * @{
 */

#ifndef MODULE_ESP_HW_COUNTER
/**
 * @brief Hardware timer modules are used for timer implementation (default)
 *
 * Since one timer is used for the system time, there is one timer less than
 * the total number of timers.
 */
#define TIMER_NUMOF         (SOC_TIMER_GROUP_TOTAL_TIMERS - 1)
#define TIMER_CHANNEL_NUMOF (1)
#endif

/** Timer group used for system time */
#define TIMER_SYSTEM_GROUP      TIMER_GROUP_0
/** Index of the timer in the timer timer group used for system time */
#define TIMER_SYSTEM_INDEX      TIMER_0
/** System time interrupt source */
#define TIMER_SYSTEM_INT_SRC    ETS_TG0_T0_LEVEL_INTR_SOURCE

/** @} */

/**
 * @brief   Prevent shared timer functions from being used
 */
#define PERIPH_TIMER_PROVIDES_SET

/**
 * @name   UART configuration
 *
 * ESP32x SoCs integrate up to three UART devices, depending on the specific
 * ESP32x SoC variant (family).
 *
 * The pin configuration of the UART device UART_DEV(n) is defined in the
 * board-specific peripheral configuration by
 *
 * - `UARTn_TXD`, the GPIO used as TxD signal for UART_DEV(n), and
 * - `UARTn_RXD`, the GPIO used as RxD signal for UART_DEV(n),
 *
 * where `n` can be in range of 0 and UART_NUMOF_MAX-1. If they are not defined,
 * the according UART interface UART_DEV(n) is not used, for example:
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~{.c}
 * #define UART1_TX    GPIO10  // TxD signal of UART_DEV(1)
 * #define UART1_RX    GPIO9   // RxD signal of UART_DEV(1)
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *
 * The pin configuration of UART interfaces can be changed by
 * [application specific configurations](#esp32_application_specific_configurations)
 * by overriding the according `UARTn_*` symbols.
 *
 * @note To ensure that the `UARTn_*` symbols define the configuration for
 *       UART_DEV(n), the configuration of the UART interfaces UART_DEV(n)
 *       must be in continuous ascending order of `n`. That is, if UART_DEV(1)
 *       is to be used by defining the `UART1_*` symbols, UART_DEV(0) must also
 *       be used by defining the `UART0_*` symbols, and if UART_DEV(2)
 *       is to be used by defining the `UART2_*` symbols, UART_DEV(0) and
 *       UART_DEV(1) must also be used by defining the `UART0_*` and
 *       `UART1_*` symbols
 *
 * #UART_NUMOF is determined automatically from the board-specific peripheral
 * configuration for UART_DEV(n).
 *
 * UART_DEV(0) has usually a fixed pin configuration that is used by all
 * ESP32x boards as standard configuration for the console. The GPIOs
 * used for UART_DEV(0) depend on the ESP32x SoC family.
 *
 * @{
 */

/**
 * @brief   UART configuration structure type
 */
typedef struct {
    gpio_t txd;             /**< GPIO used as TxD pin */
    gpio_t rxd;             /**< GPIO used as RxD pin */
} uart_conf_t;

/**
 * @brief   Maximum number of UART interfaces
 */
#define UART_NUMOF_MAX  (SOC_UART_NUM)
/** @} */

#ifdef __cplusplus
}
#endif

/**
 * @brief   Include ESP32x family specific peripheral configuration
 */
#if defined(CPU_FAM_ESP32)
#include "periph_cpu_esp32.h"
#elif defined(CPU_FAM_ESP32C3)
#include "periph_cpu_esp32c3.h"
#else
#error "ESP32x family implementation missing"
#endif

#ifdef MODULE_PERIPH_CAN
#include "can_esp.h"
#endif

#endif /* PERIPH_CPU_H */
/** @} */
